Revit 2026 API

# RebarHostDataIsFaceExposed Method

---

Checks whether the specified face is considered exposed, and therefore has an associated CoverType.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsFaceExposed(
	Reference face
)
```
```vb
Public Function IsFaceExposed (
	face As Reference
) As Boolean
```
```cpp
public:
bool IsFaceExposed(
	Reference^ face
)
```
```fsharp
member IsFaceExposed :
        face : Reference -> bool
```

#### Parameters

face Reference

#### Return Value

Boolean True if %face% is exposed, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method replaces the method HasCoverTypeForReference() from the 2011 Revit API.

#### Reference

RebarHostData Class

Autodesk.Revit.DB.Structure Namespace